# IdeaStatiCa.ConnectionApi.Model.SlottedHole
Slotted hole of one fastener position in one connected plate

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**PositionId** | **int** | Id of the fastener position - matches the Id of the corresponding item in IdeaRS.OpenModel.Connection.FastenerGridBase.Positions | [optional]
**Plate** | **ReferenceElement** |  | [optional]
**SizeFactor** | **double** | Ratio of the slot length to the borehole diameter - slot length &#x3D; borehole * SizeFactor | [optional]
**Angle** | **double** | Direction of the slot in the plate LCS [rad] | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)